[
    {
        "origin": "United States",
        "destination": "Afghanistan",
        "requirement": "Visa required",
        "notes": "Visitors born in Afghanistan do not require a visa. All visitors are required to register with the Ministry of Foreign Affairs upon arrival. The U.S. government forced all Afghan diplomatic missions in the U.S. to close in March 2022. Applicants must now obtain a visa from a mission in another country. Since 2024, the Taliban only accepts visas issued by approved diplomatic missions, though those who have already entered on a visa issued by another mission are allowed to stay. The U.S. government advises its citizens not to visit Afghanistan due to civil unrest, crime, terrorism, risk of wrongful detention, kidnapping, and limited health facilities. U.S. citizens in Afghanistan are urged to depart immediately via commercial means if possible."
    },
    {
        "origin": "United States",
        "destination": "Albania",
        "requirement": "Visa not required",
        "notes": "One must leave for 90 days to reset the visa free period."
    },
    {
        "origin": "United States",
        "destination": "Algeria",
        "requirement": "Visa required",
        "notes": "Application for a tourist visa to Algeria must be accompanied by a certificate of accommodation. Persons may be denied entry if entering with a passport containing visas or stamps issued by Israel. Visa can be obtained on arrival for certain cities in the southern region of the country if travel is booked through a local travel agency."
    },
    {
        "origin": "United States",
        "destination": "Andorra",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Angola",
        "requirement": "Visa not required",
        "notes": "30 days per stay, max 90 days in a year. Proof of onwards tickets and hotel reservations required. Yellow fever vaccine no longer required of US citizens."
    },
    {
        "origin": "United States",
        "destination": "Antigua and Barbuda",
        "requirement": "Visa not required",
        "notes": "Stringent application of rules regarding proof of sufficient funds, return ticket and accommodation."
    },
    {
        "origin": "United States",
        "destination": "Argentina",
        "requirement": "Visa not required",
        "notes": "Extendable up to 180 days. Argentina requires a mandatory travellers to have a health insurance prior to the arrival as July 2025."
    },
    {
        "origin": "United States",
        "destination": "Armenia",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Australia",
        "requirement": "Electronic Travel Authority",
        "notes": "90 days on each visit in 12-month period if granted. May enter using SmartGate."
    },
    {
        "origin": "United States",
        "destination": "Austria",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area. Residence permit (Aufenthaltstitel) for stays of longer than 90 days obtainable after arrival under certain conditions."
    },
    {
        "origin": "United States",
        "destination": "Azerbaijan",
        "requirement": "eVisa / Visa on arrival (conditional)",
        "notes": "Travelers departing from New York can obtain a visa at the airport upon arrival in Baku, however no airline currently operates this route. Visa can be obtained on arrival in certain emergency situations. If staying in Azerbaijan for more than ten days, visitors must register at the State Migration Service within three days of arrival. Applicants of Armenian ancestry or with Armenian visas in their passport may be denied a visa. Travellers with a visa or evidence of travel to the now-defunct Republic of Artsakh (stamps) are permanently denied entry."
    },
    {
        "origin": "United States",
        "destination": "The Bahamas",
        "requirement": "Visa not required",
        "notes": "Passport card or enhanced drivers license valid for sea travel."
    },
    {
        "origin": "United States",
        "destination": "Bahrain",
        "requirement": "eVisa / Visa on arrival",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Bangladesh",
        "requirement": "Visa on arrival",
        "notes": "Visa on arrival is available at Dhaka, Chittagong, and Sylhet international airports, pre arrival visa required if arriving by sea or by land border crossing. No visa required for Bangladeshi Americans and their spouse and children with a copy of a former Bangladeshi passport, a Dual Nationality Certificate, NVR, a Bangladeshi NID, or a digital birth registration certificate."
    },
    {
        "origin": "United States",
        "destination": "Barbados",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Belarus",
        "requirement": "eVisa",
        "notes": "The U.S. government advises its citizens not to visit Belarus due to the Belarusian authorities’ arbitrary enforcement of local laws, the risk of detention, the continued facilitation of Russia’s war against Ukraine, the potential of civil unrest, and the Embassy’s limited ability to assist U.S. citizens residing in or traveling to Belarus. U.S. citizens in Belarus are advised to depart immediately."
    },
    {
        "origin": "United States",
        "destination": "Belgium",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area Residence permit (Titre de séjour/Verblijfstitel/Aufenthaltstitel) obtainable after arrival for stays longer than 90 days under certain conditions."
    },
    {
        "origin": "United States",
        "destination": "Belize",
        "requirement": "Visa not required",
        "notes": "Mandatory Car Disinfection at border. If one fails to do so, they will be sent back to go through this procedure. A fee does apply."
    },
    {
        "origin": "United States",
        "destination": "Benin",
        "requirement": "eVisa",
        "notes": "International Certificate of Vaccination or Prophylaxis required. eVisas are available for 30 or 90 days."
    },
    {
        "origin": "United States",
        "destination": "Bhutan",
        "requirement": "eVisa",
        "notes": "“Sustainable Development Fee”of 100 USD per day for almost all visitors to Bhutan. Tour guide required for all travelers except in city of Thimpu and Paro. Even in these cities, tourists are not permitted to enter any tourist attraction without a guide. They are only allowed to walk and shop around these cities without a guide."
    },
    {
        "origin": "United States",
        "destination": "Bolivia",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Bosnia and Herzegovina",
        "requirement": "Visa not required",
        "notes": "90 days within any 6-month period."
    },
    {
        "origin": "United States",
        "destination": "Botswana",
        "requirement": "Visa not required",
        "notes": "90 days within any 1-year period."
    },
    {
        "origin": "United States",
        "destination": "Brazil",
        "requirement": "eVisa",
        "notes": "Brazilian authorities have announced that United States citizens will require a visa beginning April 10, 2025. United States citizens will be able to obtain visas online."
    },
    {
        "origin": "United States",
        "destination": "Brunei",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Bulgaria",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area."
    },
    {
        "origin": "United States",
        "destination": "Burkina Faso",
        "requirement": "Admission refused",
        "notes": "International Certificate of Vaccination or Prophylaxis required. The U.S. government advises its citizens not to visit Burkina Faso for any reason due to terrorism, crime, and kidnapping. Following Niger's example, Burkina Faso has suspended visa services for U.S. citizens and barred Americans from entering."
    },
    {
        "origin": "United States",
        "destination": "Burundi",
        "requirement": "Online Visa / Visa on arrival",
        "notes": "Visa on arrival obtainable at Bujumbura International Airport, and all land borders."
    },
    {
        "origin": "United States",
        "destination": "Cambodia",
        "requirement": "eVisa / Visa on arrival",
        "notes": "Visa is also obtainable online."
    },
    {
        "origin": "United States",
        "destination": "Cameroon",
        "requirement": "eVisa",
        "notes": "International Certificate of Vaccination or Prophylaxis and current immunization records required."
    },
    {
        "origin": "United States",
        "destination": "Canada",
        "requirement": "Visa not required",
        "notes": "Anyone with a criminal record (including misdemeanors or alcohol-related driving offenses in the US) may not be able to enter Canada without first obtaining an approval for rehabilitation or a Temporary Resident Permit (TRP). Passport Card, NEXUS card, or enhanced drivers license valid for land and sea travel. United States citizens and permanent residents are exempt from obtaining Canada ETA."
    },
    {
        "origin": "United States",
        "destination": "Cape Verde",
        "requirement": "EASE",
        "notes": "Must register online at least five days prior to arrival."
    },
    {
        "origin": "United States",
        "destination": "Central African Republic",
        "requirement": "Visa required",
        "notes": "International Certificate of Vaccination or Prophylaxis required. The U.S. government advises its citizens not to visit Central African Republic (CAR) due to armed conflict, crime, civil unrest, and kidnapping, as well as Embassy Bangui’s limited capacity to provide support to U.S. citizens."
    },
    {
        "origin": "United States",
        "destination": "Chad",
        "requirement": "Admission suspended",
        "notes": "On June 5, 2025, Chad has suspended visa issuances to U.S. citizens in response to Donald Trump's travel ban, current visas will still be honored until their expiration. Dual-citizens of Chad can still travel to Chad but can only travel with a valid Chad passport. Passengers with an entry authorisation issued by the authorities of Chad can obtain a visa on arrival. International Certificate of Vaccination or Prophylaxis required only if arriving from a high risk country as defined by the WHO. Registration within 72 hours is mandatory prior to arrival."
    },
    {
        "origin": "United States",
        "destination": "Chile",
        "requirement": "Visa not required",
        "notes": "No reciprocity fees required."
    },
    {
        "origin": "United States",
        "destination": "China",
        "requirement": "Visa required",
        "notes": "30-day visa‑free entry to Hainan Province if arriving at the island from outside Mainland China. 240-hour (10-day) visa-free transit to a third country or region (including Hong Kong, Macau or Taiwan) using any mode of transport. Must have a confirmed onward ticket/itinerary, and enter through 1 of 64 approved ports. During which, may freely travel within the 24 provinces permitted for visa-free transit and engage in tourism, business, and visits. 24-hour visa-free transit to a third country or region (including Hong Kong, Macau, and Taiwan), is available at most international airports, without leaving the airport. Travellers who need to leave the airport may obtain a temporary entry permit from immigration. 5-day port visa (Visa on Arrival) for Shenzhen if arriving at designated ports of entry from Hong Kong by land or sea, for stays within Shenzhen. 3-day port visa (Visa on Arrival) if arriving in Zhuhai or Xiamen at designated ports of entry, for stays within the respective city. 15-day visa-free entry for cruise ship passengers in tour groups, if arriving at any cruise port along China's coastline, including but not limited to Tianjin; Dalian; Shanghai; Lianyungang; Wenzhou; Zhoushan; Xiamen; Qingdao; Guangzhou; Shenzhen; Beihai; Haikou; Sanya. May further travel inland to all regions of coastal provinces (and equivalents) and Beijing. May apply for a port visa (Visa on Arrival) if travelling for an urgent, qualified reason. Prior clearance for port visa is highly recommended or may be denied boarding by airlines. Visas for U.S. citizens are valid for up to 10 years. U.S. citizens arriving via cruise ports as part of tour groups are visa exempt for stays of up to 15 days."
    },
    {
        "origin": "United States",
        "destination": "Colombia",
        "requirement": "Visa not required",
        "notes": "Extendable up to 180-days stay within a one-year period Colombian-born U.S. citizens and U.S. citizens traveling with children may face special exit requirements."
    },
    {
        "origin": "United States",
        "destination": "Comoros",
        "requirement": "Visa on arrival",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Republic of the Congo",
        "requirement": "eVisa required",
        "notes": "International Certificate of Vaccination or Prophylaxis required. In April 2019 Congolese authorities announced a plan to introduce an electronic visa in August 2019. Visa applications can already be submitted online at the Republic of the Congo embassy in France website."
    },
    {
        "origin": "United States",
        "destination": "Democratic Republic of the Congo",
        "requirement": "eVisa",
        "notes": "International Certificate of Vaccination or Prophylaxis required. Registration required."
    },
    {
        "origin": "United States",
        "destination": "Costa Rica",
        "requirement": "Visa not required",
        "notes": "90 Days out of any 12-month period."
    },
    {
        "origin": "United States",
        "destination": "Côte d'Ivoire",
        "requirement": "eVisa",
        "notes": "e-Visa holders must arrive via Port Bouet Airport. International Certificate of Vaccination or Prophylaxis required."
    },
    {
        "origin": "United States",
        "destination": "Croatia",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area."
    },
    {
        "origin": "United States",
        "destination": "Cuba",
        "requirement": "eVisa",
        "notes": "Tourist travel is prohibited under U.S. law for U.S. citizens, permanent residents, and others subject to U.S. jurisdiction. Under the Cuban Assets Control Regulations, all persons subject to U.S. jurisdiction are not permitted to travel to Cuba unless licensed to engage in travel-related transactions. In addition to specific licenses granted by the Office of Foreign Assets Control (OFAC), there are 12 \"general licenses\" that people can choose to travel on without being required to notify OFAC, and the broad and self-reported nature of these licenses means travel is in practice subject to few restrictions. Cuba requires travelers to purchase a tourist card prior to arrival, which can be obtained from the airline or a Cuban diplomatic mission. Tourist cards are valid for one entry and a 30-day stay, which can be extended once by 90 days at a hotel or immigration office in Cuba. Cuba requires travelers to have health insurance valid in Cuba, which can be purchased from the airline."
    },
    {
        "origin": "United States",
        "destination": "Cyprus",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period."
    },
    {
        "origin": "United States",
        "destination": "Czech Republic",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area."
    },
    {
        "origin": "United States",
        "destination": "Denmark",
        "requirement": "Visa not required",
        "notes": "U.S. citizens can enter Denmark for up to 90 days out of any 180 day period, regardless of time spent in other Schengen countries prior to entry into Denmark."
    },
    {
        "origin": "United States",
        "destination": "Djibouti",
        "requirement": "eVisa",
        "notes": "eVisas valid at any port of entry."
    },
    {
        "origin": "United States",
        "destination": "Dominica",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Dominican Republic",
        "requirement": "Visa not required",
        "notes": "Extendable up to 90 days. Passport card or enhanced drivers license valid for sea travel."
    },
    {
        "origin": "United States",
        "destination": "Ecuador",
        "requirement": "Visa not required",
        "notes": "Extendable for another 90 days, per year"
    },
    {
        "origin": "United States",
        "destination": "Egypt",
        "requirement": "eVisa / Visa on arrival",
        "notes": "eVisa issued for 30 days. Visa-free travel for tourists arriving at Sharm El Sheikh, St. Catherine, or Taba airports and remaining in the Sinai resorts up to 15 days."
    },
    {
        "origin": "United States",
        "destination": "El Salvador",
        "requirement": "Visa not required",
        "notes": "Part of the Central America-4 Free Mobility Agreement. One ninety-day extension may be granted if applied five days before the first expires. In the CA4 area, one gets 90 days total for the entire area. To reset one's stay, they must leave the area."
    },
    {
        "origin": "United States",
        "destination": "Equatorial Guinea",
        "requirement": "eVisa",
        "notes": "International Certificate of Vaccination or Prophylaxis required if one is traveling from a country with risk of yellow fever."
    },
    {
        "origin": "United States",
        "destination": "Eritrea",
        "requirement": "Visa required",
        "notes": "Permit required to leave capital."
    },
    {
        "origin": "United States",
        "destination": "Estonia",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area"
    },
    {
        "origin": "United States",
        "destination": "Eswatini",
        "requirement": "Visa not required",
        "notes": "Extendable up to 60 days"
    },
    {
        "origin": "United States",
        "destination": "Ethiopia",
        "requirement": "eVisa / Visa on arrival",
        "notes": "Visa on arrival is obtainable only at Addis Ababa Bole International Airport. e-Visa holders must arrive via Addis Ababa Bole International Airport. e-Visa is available for 30 or 90 days."
    },
    {
        "origin": "United States",
        "destination": "Fiji",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Finland",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area"
    },
    {
        "origin": "United States",
        "destination": "France",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area (in Regions of France) A bilateral agreement pre-dating the Schengen area may allow 90 days of stay in France regardless of days spent in other Schengen countries."
    },
    {
        "origin": "United States",
        "destination": "Gabon",
        "requirement": "eVisa",
        "notes": "eVisas are available for one to six months. eVisa holders must arrive via Libreville International Airport. International Certificate of Vaccination or Prophylaxis required. Embassy visas are valid for 5 years and multiple entries for US citizens"
    },
    {
        "origin": "United States",
        "destination": "Gambia",
        "requirement": "Visa on arrival",
        "notes": "International Certificate of Vaccination or Prophylaxis required only for travellers arriving high risk countries and having transited for more than 12 hours"
    },
    {
        "origin": "United States",
        "destination": "Georgia",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Germany",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area Residence permit (Aufenthaltstitel) for stays of longer than 90 days obtainable after arrival under certain conditions. Germany requires that all passports be signed."
    },
    {
        "origin": "United States",
        "destination": "Ghana",
        "requirement": "eVisa",
        "notes": "Pre approved visa can be obtained on arrival. International Certificate of Vaccination or Prophylaxis required. Visas for US citizens are either single entry or multiple entry and valid for 5 years. The fee for single entry 3 month validity is US$60 and the fee for the multiple entry visa is US$100."
    },
    {
        "origin": "United States",
        "destination": "Greece",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area"
    },
    {
        "origin": "United States",
        "destination": "Grenada",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Guatemala",
        "requirement": "Visa not required",
        "notes": "Part of the Central America-4 Free Mobility Agreement. In the CA4 area, one gets 90 days total for the entire area. To reset one's stay, they must leave the area."
    },
    {
        "origin": "United States",
        "destination": "Guinea",
        "requirement": "eVisa",
        "notes": "International Certificate of Vaccination or Prophylaxis required."
    },
    {
        "origin": "United States",
        "destination": "Guinea-Bissau",
        "requirement": "Visa on arrival",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Guyana",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Haiti",
        "requirement": "Visa not required",
        "notes": "Travel currently almost impossible due to gang violence. Only open borders are the sea borders. Air borders are currently not open, nor is the border with the Dominican Republic. Foreign visitors are required to pay a US$10 Tourist visa fee. The U.S. government advises its citizens not to visit Haiti due to kidnapping, crime, civil unrest, and limited health care."
    },
    {
        "origin": "United States",
        "destination": "Honduras",
        "requirement": "Visa not required",
        "notes": "Part of the Central America-4 Free Mobility Agreement. In the CA4 area, one gets 90 days total for the entire area. To reset one's stay, they must leave the area."
    },
    {
        "origin": "United States",
        "destination": "Hungary",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area"
    },
    {
        "origin": "United States",
        "destination": "Iceland",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area"
    },
    {
        "origin": "United States",
        "destination": "India",
        "requirement": "eVisa",
        "notes": "e-Visa holders must arrive via 32 designated airports or 5 designated seaports. An Indian e-Tourist Visa may only be obtained twice within 1 calendar year. Foreigners of Pakistani origin or who hold a Pakistani Passport are not eligible for an e-Visa. Foreigners who are not Pakistani nationals, but whose parents or grandparents (either paternal or maternal) were born in, or were permanent residents in Pakistan, are also not eligible for an e-Visa. American citizens are also eligible for a ten-year, multiple-entry tourist visa. American citizens of Pakistani heritage are not eligible for an eVisa nor are they eligible for a ten-year, multiple-entry tourist visa, and must apply for a regular visa."
    },
    {
        "origin": "United States",
        "destination": "Indonesia",
        "requirement": "e-VOA / Visa on arrival",
        "notes": "Indonesian authorities have announced that citizens of the United States may be granted visa-free entry within the upcoming month"
    },
    {
        "origin": "United States",
        "destination": "Iran",
        "requirement": "Visa required",
        "notes": "Iranian visas must be obtained from the Iranian Interests section of the Embassy of Pakistan, Washington, D.C. or an Iranian embassy in a third country. Independent travelers must be accompanied by an authorized guide at all times. Admission refused if passport contains stamps or visas issued by Israel. The U.S. government advises its citizens not to visit Iran due to the risk of terrorism, civil unrest, kidnapping, arbitrary arrest of U.S. citizens, and wrongful detention."
    },
    {
        "origin": "United States",
        "destination": "Iraq",
        "requirement": "eVisa",
        "notes": "Authorities in Iraq have decided to remove the visa-on-arrival requirement for nationals of the European Union and several other countries, requiring them to now apply for an e-visa to enter Iraq through the official platform. The U.S. government advises its citizens not to visit Iraq for any reason due to terrorism, kidnapping, armed conflict, civil unrest, and the U.S. government’s limited ability to provide emergency services to U.S. citizens in Iraq."
    },
    {
        "origin": "United States",
        "destination": "Ireland",
        "requirement": "Visa not required",
        "notes": "Residence permit for stays of longer than 90 days obtainable after arrival under certain conditions."
    },
    {
        "origin": "United States",
        "destination": "Israel",
        "requirement": "Electronic Travel Authorization",
        "notes": "Dual nationals of Israel and the United States who don't have an Israeli passport, including infants, may be required to obtain an Israeli passport in order to leave Israel. Entry prohibited for any person \"who knowingly issues a public call for boycotting Israel\". Starting January 1, 2025, an ETA just like a US ESTA or a Canada ETA will be required for travel to Israel. Applications opened on June 1 as a trial but are not required for US and German passport holders until January 1, 2025. On July 1, 2024, the application has been opened to all visa exempt country passport holders."
    },
    {
        "origin": "United States",
        "destination": "Italy",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area A bilateral agreement pre-dating the Schengen area may allow 90 days of stay in Italy regardless of days spent in other Schengen countries."
    },
    {
        "origin": "United States",
        "destination": "Jamaica",
        "requirement": "Visa not required",
        "notes": "Departure tax collected by airline for all arrivals by air."
    },
    {
        "origin": "United States",
        "destination": "Japan",
        "requirement": "Visa not required",
        "notes": "Persons who have been sentenced to 1 year or more of jail are not eligible for visa free travel to Japan. United States citizens are also eligible for a Japanese eVisa."
    },
    {
        "origin": "United States",
        "destination": "Jordan",
        "requirement": "eVisa / Visa on arrival",
        "notes": "Visa can be obtained upon arrival. Not available at King Hussein/Allenby Bridge Crossing via any border with Israel may cause issues when entering some countries. Visa fee can be waived with Jordan Pass and three night hotel stay."
    },
    {
        "origin": "United States",
        "destination": "Kazakhstan",
        "requirement": "Visa not required",
        "notes": "Visa free was granted in 2014 under the unilateral visa waiver for countries with high investment in the Kazakhstan economy."
    },
    {
        "origin": "United States",
        "destination": "Kenya",
        "requirement": "Electronic Travel Authorisation",
        "notes": "Applications can be submitted up to 90 days prior to travel and must be submitted at least 3 days in advance. eTA fee is USD 32.50. Proof of reservation at the hotel where visitors plan to stay is required (if staying with friends, an invitation letter is also acceptable). Yellow fever vaccination certificate is required if coming from endemic countries."
    },
    {
        "origin": "United States",
        "destination": "Kiribati",
        "requirement": "Visa not required",
        "notes": "May not exceed 90 days within any 12-month period."
    },
    {
        "origin": "United States",
        "destination": "North Korea",
        "requirement": "Travel restricted by U.S. government",
        "notes": "U.S. passports holders must obtain a special passport validation from the U.S. federal government before travel. Such validations are only ever issued if travel is in the interests of US national security. United States citizens require a visa when traveling to North Korea; as there is no North Korean diplomatic mission in the United States, US citizens must obtain a visa from a diplomatic mission in a third country. U.S. secretary of state Rex Tillerson authorized a ban on American travel to North Korea that went into effect in August 2017, following the death of Otto Warmbier, a US student who was detained in North Korea and sentenced to 15 years of hard labor for allegedly stealing a propaganda poster. The U.S. government advises its citizens not to visit North Korea for any reason due to the continuing serious risk of arrest, long-term detention, and the threat of wrongful detention of U.S. nationals."
    },
    {
        "origin": "United States",
        "destination": "South Korea",
        "requirement": "Visa not required",
        "notes": "From September 2021, travelers require the Korean Electronic Travel Authorization (K-ETA). The validity period is 3 years from the date of approval. The government of the Republic of Korea announced that from April 1, 2023, to December 31, 2025, a K-ETA is not required for 27 countries citizens visiting Korea for 90 days or less for business or tourism."
    },
    {
        "origin": "United States",
        "destination": "Kuwait",
        "requirement": "eVisa / Free Visa on arrival",
        "notes": "Visa on arrival is free for US citizens"
    },
    {
        "origin": "United States",
        "destination": "Kyrgyzstan",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Laos",
        "requirement": "eVisa / Visa on arrival",
        "notes": "18 of the 33 border crossings are only open to regular visa holders. e-Visa may be used to enter Laos through the Luang Prabang, Pakse and Vientiane international airports, 3 Thai-Lao Friendship Bridges, in Boten (road and railroad), and in Vientiane (at Khamsavath railway station). Visa on arrival is available at the Luang Prabang, Pakse and Vientiane international airports, 4 Thai-Lao Friendship Bridges and 7 border crossings."
    },
    {
        "origin": "United States",
        "destination": "Latvia",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area. A bilateral agreement pre-dating the Schengen area allows an additional 90 days of stay in Latvia (to a total of 180) regardless of days spent in other Schengen countries."
    },
    {
        "origin": "United States",
        "destination": "Lebanon",
        "requirement": "Free visa on arrival",
        "notes": "Extendable for 2 additional months. Visa waiver granted if there is no Israeli visa or seal and traveler has a telephone number, an address in Lebanon, and a non refundable return or circle trip ticket. Pagers and handheld radios prohibited from boarding flights in Lebanon to protect aviation safety. The US government advises its citizens not to visit Lebanon due to crime, terrorism, civil unrest, kidnapping, unexploded landmines, and the risk of armed conflict."
    },
    {
        "origin": "United States",
        "destination": "Lesotho",
        "requirement": "Visa not required",
        "notes": "Extendable up to 180 days."
    },
    {
        "origin": "United States",
        "destination": "Liberia",
        "requirement": "eVisa required",
        "notes": "all persons entering Liberia are required to have a valid Certificate of Immunization (Yellow Book). Starting March 11, 2025, international travelers can apply for an electronic visa on arrival to visit Liberia, but if there is a Liberian embassy in one's country, the traveler is required to apply for a visa directly at the embassy and not through this portal. 3-year Multiple Entry Visa is the only option."
    },
    {
        "origin": "United States",
        "destination": "Libya",
        "requirement": "eVisa",
        "notes": "The U.S. government advises its citizens not to visit Libya due to crime, terrorism, unexploded landmines, civil unrest, kidnapping, and armed conflict. U.S. citizens who are in Libya are urged to depart as soon as possible via commercial means if possible."
    },
    {
        "origin": "United States",
        "destination": "Liechtenstein",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area"
    },
    {
        "origin": "United States",
        "destination": "Lithuania",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area. Mandatory medical insurance."
    },
    {
        "origin": "United States",
        "destination": "Luxembourg",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area"
    },
    {
        "origin": "United States",
        "destination": "Madagascar",
        "requirement": "eVisa / Visa on arrival",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Malawi",
        "requirement": "eVisa / Visa on arrival",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Malaysia",
        "requirement": "Visa not required",
        "notes": "Immigration offenses, such as visa overstaying, are punishable by caning."
    },
    {
        "origin": "United States",
        "destination": "Maldives",
        "requirement": "Free visa on arrival",
        "notes": "Extendable up to 90 days. Permission from the Maldivian government required to travel to non resort islands."
    },
    {
        "origin": "United States",
        "destination": "Mali",
        "requirement": "Admission refused",
        "notes": "International Certificate of Vaccination or Prophylaxis required. Visas for U.S. citizens are valid for 5 years and are 185 USD. The U.S. government advises its citizens not to visit Mali due to crime, terrorism, and kidnapping. Following Niger's example, Mali has suspended visa services for U.S. citizens and barred Americans from entering."
    },
    {
        "origin": "United States",
        "destination": "Malta",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area"
    },
    {
        "origin": "United States",
        "destination": "Marshall Islands",
        "requirement": "Right of abode",
        "notes": "The United States has a Compact of Free Association relationship with the Marshall Islands, Micronesia and Palau."
    },
    {
        "origin": "United States",
        "destination": "Mauritania",
        "requirement": "eVisa",
        "notes": "International Certificate of Vaccination or Prophylaxis required only for travellers arriving from high risk countries"
    },
    {
        "origin": "United States",
        "destination": "Mauritius",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Mexico",
        "requirement": "Visa not required",
        "notes": "Visitors must obtain a Multiple Immigration Form. There is no charge for a tourist FMM for stays of less than 7 days when entering by land. For visitors staying more than 7 days and entering by land, it will cost 687 Mexican pesos or around US$40. The FMM is required for all visitors entering via air, regardless of length of stay, and the cost is included in the traveler's airfare and remitted by the airline. Passport card or enhanced drivers license is valid for land and sea travel. Exit stamp required if one entered using paper FMM (All land POEs) A person is in Mexico illegally if they did not get a FMM at the border (even if using the 7 day FMM fee exemption via land) or eFMM Mandatory car disinfection at Mexico's southern borders (Guatemala and Belize)"
    },
    {
        "origin": "United States",
        "destination": "Micronesia",
        "requirement": "Right of abode",
        "notes": "The United States has a Compact of Free Association relationship with the Marshall Islands, Micronesia and Palau."
    },
    {
        "origin": "United States",
        "destination": "Moldova",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period. Registration upon arrival is mandatory."
    },
    {
        "origin": "United States",
        "destination": "Monaco",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period."
    },
    {
        "origin": "United States",
        "destination": "Mongolia",
        "requirement": "Visa not required",
        "notes": "Registration required after 30 days."
    },
    {
        "origin": "United States",
        "destination": "Montenegro",
        "requirement": "Visa not required",
        "notes": "Registration with the local police within 24 hours of arrival is mandatory."
    },
    {
        "origin": "United States",
        "destination": "Morocco",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Mozambique",
        "requirement": "Electronic Travel Authorization",
        "notes": "Visitors must register their ETA on the e-Visa platform at least 48 hours before travel and pay a processing fee of 650 MZN."
    },
    {
        "origin": "United States",
        "destination": "Myanmar",
        "requirement": "eVisa",
        "notes": "e-Visa holders must arrive via Yangon, Nay Pyi Taw or Mandalay airports or via land border crossings at Tachileik, Myawaddy, Kawthaung, Rih Khaw Dar or Tamu. e-Visa available for both tourism (allowed stay is 28 days) or business (allowed stay is 70 days) purposes. The U.S. government advises its citizens not to visit Myanmar due to armed conflict, the potential for civil unrest, arbitrary enforcement of local laws, poor health infrastructure, land mines and unexploded ordnance, crime, and wrongful detentions."
    },
    {
        "origin": "United States",
        "destination": "Namibia",
        "requirement": "eVisa / Visa on arrival",
        "notes": "Beginning April 1st, 2025, US citizens will have to obtain a visa for Namibia. US citizens will be issued with visas on arrival upon payment of a designated fee. Can be obtained online or on arrival for a fee of N$1,600 (approximately €82 / US$88)."
    },
    {
        "origin": "United States",
        "destination": "Nauru",
        "requirement": "Visa required",
        "notes": "Visas are issued with validity of 30 days. Visa can be obtained in the Nauruan Press Office at the United Nations."
    },
    {
        "origin": "United States",
        "destination": "Nepal",
        "requirement": "Online Visa / Visa on arrival",
        "notes": "Obtainable at Tribhuvan International Airport and certain land borders. Total aggregate stay of no more than 150 days in any given calendar year. US Citizens are eligible for five-year multiple entry visas."
    },
    {
        "origin": "United States",
        "destination": "Netherlands",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area (European Netherlands). Residence permit (Verblijfstitel) for stays of longer than 90 days obtainable after arrival under certain conditions."
    },
    {
        "origin": "United States",
        "destination": "New Zealand",
        "requirement": "Electronic Travel Authority",
        "notes": "May enter using eGate. International Visitor Conservation and Tourism Levy (IVL) must be paid upon requesting an Electronic Travel Authority. IVL not required for American Samoan citizens. Holders of an Australian Permanent Resident Visa or Resident Return Visa may be granted a New Zealand Resident Visa on arrival permitting indefinite stay (pursuant to the Trans-Tasman Travel Arrangement). Strict enforcement of food import laws, fines of NZD400 for not declaring food."
    },
    {
        "origin": "United States",
        "destination": "Nicaragua",
        "requirement": "Visa not required",
        "notes": "Tourist card must be purchased upon arrival. Part of the Central America-4 Free Mobility Agreement. In the CA4 area, a person gets 90 days total for the entire area. To reset their stay, they must leave the area."
    },
    {
        "origin": "United States",
        "destination": "Niger",
        "requirement": "Admission refused",
        "notes": "Holders of a pre-approved confirmation from the National Police may obtain a visa on arrival (flyer visa) upon arrival at Niamey. The passport will be compounded for 1 working day and the traveler is required to appear at the Director General of Immigration the next working day to register and collect their passport. International Certificate of Vaccination or Prophylaxis required. The U.S. government advises its citizens not to travel to Niger due to crime, unrest, terrorism, health, and kidnapping. Niger has suspended issuance of visas to U.S. citizens and openly barred Americans from entering."
    },
    {
        "origin": "United States",
        "destination": "Nigeria",
        "requirement": "eVisa",
        "notes": "Business eVisas-on-arrival available for \"Frequently Traveled Business Persons of International Reputes\" or \"Executives of Multi-national Companies\", as well as for government officials International Certificate of Vaccination or Prophylaxis required if arriving from a country with a risk of yellow fever transmission."
    },
    {
        "origin": "United States",
        "destination": "North Macedonia",
        "requirement": "Visa not required",
        "notes": "Registration with the local police within 24 hours of arrival is mandatory."
    },
    {
        "origin": "United States",
        "destination": "Norway",
        "requirement": "Visa not required",
        "notes": "3 months within a 6-month period, regardless of previous time spent in other Schengen countries, but including time spent in other Nordic countries."
    },
    {
        "origin": "United States",
        "destination": "Oman",
        "requirement": "Visa not required / eVisa",
        "notes": "Visa exemption valid for 10 days, eVisa for 30 days. Holders of a visa or entrance stamp of the Emirate of Dubai that is valid for at least 21 days are visa exempt. Holders of a visa for Qatar that is valid for travel to Oman and valid for at least one month are visa exempt when arriving directly from Qatar."
    },
    {
        "origin": "United States",
        "destination": "Pakistan",
        "requirement": "Free eVisa",
        "notes": "Pakistan eVisas are free for US citizens under new visa fee exemption scheme."
    },
    {
        "origin": "United States",
        "destination": "Palau",
        "requirement": "Right of abode",
        "notes": "The United States has a Compact of Free Association relationship with the Marshall Islands, Micronesia and Palau."
    },
    {
        "origin": "United States",
        "destination": "Panama",
        "requirement": "Visa not required",
        "notes": "Denial of entry or transit to any person who has a criminal conviction."
    },
    {
        "origin": "United States",
        "destination": "Papua New Guinea",
        "requirement": "eVisa",
        "notes": "Extendable for 30 days"
    },
    {
        "origin": "United States",
        "destination": "Paraguay",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Peru",
        "requirement": "Visa not required",
        "notes": "Determined on arrival."
    },
    {
        "origin": "United States",
        "destination": "Philippines",
        "requirement": "Visa not required",
        "notes": "Naturalized US citizens who have ever held Philippine nationality (current or formerly) allowed to stay for up to one year as a balikbayan. This extends to their spouse and children of any age traveling with the dual-citizen/former Filipino, and present proof of association such as their marriage or birth certificate."
    },
    {
        "origin": "United States",
        "destination": "Poland",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area. Dual nationals must use their Polish passport. A bilateral agreement pre-dating the Schengen area allows a stay in Poland regardless of days spent in other Schengen countries."
    },
    {
        "origin": "United States",
        "destination": "Portugal",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area."
    },
    {
        "origin": "United States",
        "destination": "Qatar",
        "requirement": "Visa not required",
        "notes": "Effective October 1, 2024, eligible US citizens will be granted 90 days visa free travel to the State Of Qatar Visa issued upon arrival for no cost. There is a QAR 76 entry fee, valid for 90 days. Persons with unpaid fines are prohibited from departing Qatar."
    },
    {
        "origin": "United States",
        "destination": "Romania",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area."
    },
    {
        "origin": "United States",
        "destination": "Russia",
        "requirement": "Visa required",
        "notes": "72-hour visa-free transit for international cruise ship/ferry passengers only if travelling with an organized tour and accompanied at all times by a tour operator. Registration required after 7 business days. Russia signed the \"Shared Values Visa\" law on August 19, 2024, aimed at simplifying the residence permits for citizens of countries that do not conform to Russia's traditional spirit and values. This means that one can obtain a three-month temporary residency without passing the exam. The focus of this law is to simplify the residence permit for foreign citizens with traditional Russian spirit and values. As long as they comply with Russian values, foreign citizens do not need to prove their knowledge of Russian language, Russian history, or Russian law (without examination), and can obtain a temporary residence permit for three months. By simplifying the process, more people can be attracted to settle in Russia, and these foreign citizens must come from countries that oppose Russian values. This list applies to 47 regions, including United States. American citizens may receive multiple-entry visas valid for three years. Residents of Alaska who are members of the indigenous population do not require a visa to visit Chukotka Autonomous Okrug if they have relatives (blood relatives, members of the same tribe, native people who have similar language and cultural heritage) in Chukotka. Individuals must be invited by a relative in Chukotka and must leave Chukotka within 90 days. Entry points are in Anadyr, Provideniya, Lavrentiya and Uelen. The U.S. government advises its citizens not to visit Russia for any reason for the following reasons: Danger associated with the continuing war between Russia and Ukraine. The risk of harassment or wrongful detention by Russian security officials. The arbitrary enforcement of local laws. The possibility of terrorism. US citizens in Russia are advised to leave immediately."
    },
    {
        "origin": "United States",
        "destination": "Rwanda",
        "requirement": "eVisa / Visa on arrival",
        "notes": "International Certificate of Vaccination or Prophylaxis required only if arriving from high risk countries as defined by WHO."
    },
    {
        "origin": "United States",
        "destination": "Saint Kitts and Nevis",
        "requirement": "Electronic Travel Authorisation",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Saint Lucia",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Saint Vincent and the Grenadines",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Samoa",
        "requirement": "Entry permit on arrival",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "San Marino",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "São Tomé and Príncipe",
        "requirement": "Visa not required",
        "notes": "International Certificate of Vaccination or Prophylaxis required."
    },
    {
        "origin": "United States",
        "destination": "Saudi Arabia",
        "requirement": "eVisa / Visa on arrival",
        "notes": "Access to Mecca is restricted to Muslims and non Muslims are prohibited entry to Mecca. Import of alcohol strictly prohibited."
    },
    {
        "origin": "United States",
        "destination": "Senegal",
        "requirement": "Visa not required",
        "notes": "International Certificate of Vaccination or Prophylaxis required."
    },
    {
        "origin": "United States",
        "destination": "Serbia",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period."
    },
    {
        "origin": "United States",
        "destination": "Seychelles",
        "requirement": "Electronic Border System",
        "notes": "Application can be submitted up to 30 days before travel. Visitors must upload a reservation confirmation(s) for each visitor's location of stay in Seychelles. Yellow fever vaccination certificate is required if coming from endemic countries. Payment of the fee (EUR 10) by credit or debit card. Valid for one journey only and it expires once exit the country."
    },
    {
        "origin": "United States",
        "destination": "Sierra Leone",
        "requirement": "eVisa / Visa on arrival",
        "notes": "International Certificate of Vaccination or Prophylaxis required."
    },
    {
        "origin": "United States",
        "destination": "Singapore",
        "requirement": "Visa not required",
        "notes": "US citizens can use Automated Border Control"
    },
    {
        "origin": "United States",
        "destination": "Slovakia",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area. Medical insurance required. Sufficient funds of US$50 per person per day required. Registration within 3 working days required."
    },
    {
        "origin": "United States",
        "destination": "Slovenia",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area. Registration with the local police required within 72 hours of arrival."
    },
    {
        "origin": "United States",
        "destination": "Solomon Islands",
        "requirement": "Free Visitor's permit on arrival",
        "notes": "3 months within 12 months. Visitors visa issued upon arrival for free."
    },
    {
        "origin": "United States",
        "destination": "Somalia",
        "requirement": "eVisa",
        "notes": "All visitors must have an approved Electronic Visa (eTAS) before the start of their journey. The U.S. government advises its citizens not to visit Somalia due to crime, terrorism, civil unrest, health, kidnapping, piracy, and lack of availability of routine consular services."
    },
    {
        "origin": "United States",
        "destination": "South Africa",
        "requirement": "Visa not required",
        "notes": "Holders of passports without 2 blank pages may be refused entry."
    },
    {
        "origin": "United States",
        "destination": "South Sudan",
        "requirement": "eVisa",
        "notes": "Printed visa authorization must be presented at the time of travel. International Certificate of Vaccination or Prophylaxis required. The US government advises its citizens not to visit South Sudan due to the security situation in the country. Crime, kidnappings, and armed conflict are present throughout the country."
    },
    {
        "origin": "United States",
        "destination": "Spain",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area."
    },
    {
        "origin": "United States",
        "destination": "Sri Lanka",
        "requirement": "ETA / Visa on arrival",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Sudan",
        "requirement": "Visa required",
        "notes": "If arriving from a country of high yellow fever risk and stayed for more than 12 hours, then Yellow Fever vaccine required. Exit visa required. Registration within 3 days mandatory. The U.S. government advises its citizens not to visit Sudan due to armed conflict, civil unrest, crime, terrorism, and kidnapping. Khartoum International Airport is currently closed, making it very difficult for Americans to leave the country."
    },
    {
        "origin": "United States",
        "destination": "Suriname",
        "requirement": "Visa not required",
        "notes": "An entrance fee of USD 50 or EUR 50 must be paid online prior to arrival. Multiple entry e-Visa is also available."
    },
    {
        "origin": "United States",
        "destination": "Sweden",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area."
    },
    {
        "origin": "United States",
        "destination": "Switzerland",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period in the Schengen Area."
    },
    {
        "origin": "United States",
        "destination": "Syria",
        "requirement": "eVisa",
        "notes": "Persons with passports bearing Israeli visas or entry/exit stamps are denied entry. Visa not required for foreign citizens with proof of Syrian origin, such as an identification card or passport. Dual-citizen males ages 17–42 need military service book. If not forgiven by the military, dual-citizens may apply for a visit visa once a year through the embassy. The U.S. government advises its citizens not to visit Syria for any reason due to the risk of terrorism, civil unrest, kidnapping, hostage taking, armed conflict, and unjust detention."
    },
    {
        "origin": "United States",
        "destination": "Taiwan",
        "requirement": "Visa not required",
        "notes": "Persons importing pork to Taiwan can be fined up to 1 million NT if caught."
    },
    {
        "origin": "United States",
        "destination": "Tajikistan",
        "requirement": "Visa not required / eVisa",
        "notes": "e-Visa also available. e-Visa holders can enter through all border points. Visa waiver stay is 30 days. e-Visa gives a stay of 60."
    },
    {
        "origin": "United States",
        "destination": "Tanzania",
        "requirement": "eVisa / Visa on arrival",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Thailand",
        "requirement": "Visa not required",
        "notes": "Visa waiver program rules: One can enter for 60 days per visa exempt stay. One can enter an unlimited number of times via air. Maximum of two entries if entering by sea or land. Else, one need hard visa. Overstayers will be banned and fined upon departure depending on length of overstay. All passengers must complete the Thai Digital Arrival Card (TDAC), which is available starting 3 days before arrival."
    },
    {
        "origin": "United States",
        "destination": "Timor-Leste",
        "requirement": "Visa on arrival",
        "notes": "For arrivals by air only"
    },
    {
        "origin": "United States",
        "destination": "Togo",
        "requirement": "eVisa",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Tonga",
        "requirement": "Free visa on arrival",
        "notes": "Visas issued upon arrival at no charge to the passenger. Valid for 31 days."
    },
    {
        "origin": "United States",
        "destination": "Trinidad and Tobago",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Tunisia",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Turkey",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period. Tourism purpose only."
    },
    {
        "origin": "United States",
        "destination": "Turkmenistan",
        "requirement": "Visa required",
        "notes": "10-day visa on arrival if holding letter of invitation issued by a company registered in Turkmenistan with a prior approval from the Foreign Ministry."
    },
    {
        "origin": "United States",
        "destination": "Tuvalu",
        "requirement": "Visa on arrival",
        "notes": "Extendable up to 3 months."
    },
    {
        "origin": "United States",
        "destination": "Uganda",
        "requirement": "eVisa",
        "notes": "Must apply online at least 2 business days prior to travel. Airlines may deny passengers permission to board flights to Uganda without proof that they had successfully applied for an eVisa. Ugandan immigration authorities may require additional documentation, including proof of a return plane ticket and detailed tour itinerary in Uganda. International Certificate of Vaccination or Prophylaxis required."
    },
    {
        "origin": "United States",
        "destination": "Ukraine",
        "requirement": "Visa not required",
        "notes": "90 days within any 180-day period Entry via Russian occupied territories are considered illegal and will result in legal consequences Entry only possible via land or sea following closure of air borders on February 24, 2022 due to the Russian invasion of Ukraine. The U.S. government advises its citizens not to visit Ukraine due to Russia's aggression towards Ukraine."
    },
    {
        "origin": "United States",
        "destination": "United Arab Emirates",
        "requirement": "Visa not required",
        "notes": "Extension possible with a fee. Iris scan taken on arrival. U.S. passport holders can sign up for E-Gate access on arrival/departure at Dubai International Airport."
    },
    {
        "origin": "United States",
        "destination": "United Kingdom",
        "requirement": "Electronic Travel Authorisation",
        "notes": "Up to 90 days if arriving from Ireland (Common Travel Area) An ETA is required to travel to the United Kingdom, including Northern Ireland."
    },
    {
        "origin": "United States",
        "destination": "Uruguay",
        "requirement": "Visa not required",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Uzbekistan",
        "requirement": "Visa not required",
        "notes": "5-day visa-free transit at the international airports if holding a confirmed onward ticket for a flight to a third country. Registration within 3 days is mandatory. Starting January 1, 2026, all U.S. citizens will be able to enter Uzbekistan visa-free and stay for up to 30 days."
    },
    {
        "origin": "United States",
        "destination": "Vanuatu",
        "requirement": "Visa not required",
        "notes": "Extendable up to 120 days."
    },
    {
        "origin": "United States",
        "destination": "Vatican City",
        "requirement": "Visa not required",
        "notes": "Open borders but de facto follows Italian visa policy. No foreign accommodations, residency restricted to Vatican citizens only. Even though no hotels exist in the Vatican, there is no limit to how many times a person may enter the country in a year."
    },
    {
        "origin": "United States",
        "destination": "Venezuela",
        "requirement": "Visa required",
        "notes": "The U.S. government advises its citizens not to travel to or remain in Venezuela for any reason due to the high risk of wrongful detention, torture in detention, terrorism, kidnapping, arbitrary enforcement of local laws, crime, civil unrest, and poor health infrastructure. U.S. citizens and Lawful Permanent Residents in Venezuela are strongly advised to depart immediately."
    },
    {
        "origin": "United States",
        "destination": "Vietnam",
        "requirement": "eVisa",
        "notes": "e-Visa is valid up to the exit date stated on application with a maximum length of 90 days, single and multiple entry options. Phú Quốc visa exemption for up to 30 days."
    },
    {
        "origin": "United States",
        "destination": "Yemen",
        "requirement": "eVisa required",
        "notes": "Registration mandatory. Exit visa required for stays over 30 days. Passengers can transit without visa with a confirmed onward ticket for a flight to a third country within 24 hours. They must stay in the international transit area of the airport and have documents required for the next destination. Passengers can transit without visa with a confirmed onward ticket for a flight to a third country within 24 hours. They must stay in the international transit area of the airport and have documents required for the next destination. Yemen introduces electronic visa system since June 24, 2025 for some eligible nationals. The U.S. government advises its citizens not to visit Yemen due to terrorism, civil unrest, crime, health risks, kidnapping, armed conflict, and landmines."
    },
    {
        "origin": "United States",
        "destination": "Zambia",
        "requirement": "Visa not required",
        "notes": "Also eligible for a universal visa allowing access to Zimbabwe. Two blank pages required. International Certificate of Vaccination or Prophylaxis required only travellers arriving from certain places as defined by Government. Please check the WHO 2020 Yellow Fever vaccination requirements document for exact list."
    },
    {
        "origin": "United States",
        "destination": "Zimbabwe",
        "requirement": "eVisa / Visa on arrival",
        "notes": "Also eligible for a universal visa allowing access to Zambia. Tourism purposes only."
    },
    {
        "origin": "United States",
        "destination": "Visa Passport Travel document",
        "requirement": "Visa Passport Travel document",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Africa",
        "requirement": "Africa",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Americas",
        "requirement": "Americas",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Asia",
        "requirement": "Asia",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Europe",
        "requirement": "Europe",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Oceania",
        "requirement": "Oceania",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "Historical",
        "requirement": "Historical",
        "notes": ""
    },
    {
        "origin": "United States",
        "destination": "1 British Overseas Territories. 2 These countries span the conventional boundary between Europe and Asia. 3 Partially recognized. 4 Unincorporated territory of the United States. 5 Part of the Kingdom of Denmark. 6 Egypt spans the boundary between Africa and Asia. 7 Unrecognized state.",
        "requirement": "1 British Overseas Territories. 2 These countries span the conventional boundary between Europe and Asia. 3 Partially recognized. 4 Unincorporated territory of the United States. 5 Part of the Kingdom of Denmark. 6 Egypt spans the boundary between Africa and Asia. 7 Unrecognized state.",
        "notes": ""
    }
]